-- 178.分数排名
-- SQL 架构

---编写一个SQL查询来实现分数排名。如果两个分数相同，则两个分数排名（ Rank ）相同。
---请注意 ，平分后的下一个名次应该是下一个连续的整数值。换句话说，名次之间不应该有“ 间隔 ” 。
---+----+-------+
---| Id | Score | 
---+----+-------+
---| 1  | 3.50  | 
---| 2  | 3.65  | 
---| 3  | 4.00  | 
---| 4  | 3.85  | 
---| 5  | 4.00  | 
---| 6  | 3.65  | 
---+----+-------+
---例如，根据上述给定的Scores表，你的查询应该返回（按分数从高到低排列）： 
---+-------+------+
---| Score | Rank | 
---+-------+------+
---| 4.00  |   1  | 
---| 4.00  |   1  | 
---| 3.85  |   2  | 
---| 3.65  |   3  | 
---| 3.65  |   3  | 
---| 3.50  |   4  | 
---+-------+------+

--- 解法一
先将成绩倒序排列，然后获取大于等于当前成绩的成绩的个数（要去重，因为有并列次序）
就是当前成绩的排名（成绩是由高到低排序的）
SELECT
  b.Score AS Score,
  (
    SELECT
      COUNT(DISTINCT a.Score)
    FROM
      Scores AS a
    WHERE
      a.Score >= b.Score
  ) AS `Rank`
FROM
  Scores AS b
ORDER BY
  b.Score DESC;